DataProcessors/бит_рлс_НастройкаПравДоступаПоОбъектамУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_рлс_НастройкаПравДоступаПоОбъектамУчета</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретНаВсе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_рлс_НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_рлс_НастройкиПравДоступаПользователей</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДоступа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗапретНаВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДоступа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_рлс_НастройкаПравДоступаПоОбъектамУчета/Forms/Форма/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Процедура устанавливает отбор.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УстановитьОтбор()
	
	Идентификатор = ?(Элементы.ВидыДоступа.ТекущаяСтрока = Неопределено,
					0,
					Элементы.ВидыДоступа.ТекущаяСтрока);
	
	ТекущиеДанные = Объект.ВидыДоступа.НайтиПоИдентификатору(Идентификатор);
	
	Элементы.ВидыДоступа.ТекущаяСтрока = Идентификатор;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Элементы.ЗначенияДоступа.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидДоступа", ТекущиеДанные.ВидДоступа);
	КонецЕсли; 
	
КонецПроцедуры // ()

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗписатьИЗкрыть(Команда)
	
	ЗаписатьИзменения();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьДанныеТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьИзменения();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДанныеТаблиц();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ЗаполнитьДанныеТаблиц();
	КонецЕсли;
	
	УстановитьОтбор();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляВидыДоступа

&НаКлиенте
Процедура ВидыДоступаПриАктивизацииСтроки(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоступаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоступаИспользованиеПриИзменении(Элемент)
	
	Элементы.ВидыДоступа.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоступаИспользованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Элементы.ВидыДоступаИспользование.СписокВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоступаИспользованиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоступаИспользованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеВидаДоступа = Элементы.ВидыДоступа.ТекущиеДанные;
	
	ОписаниеВидаДоступа.ЗапретНаВсе  = (ВыбранноеЗначение = "ВсеЗапрещены");
	
	Отбор = Новый Структура("ВидДоступа", ОписаниеВидаДоступа.ВидДоступа);
	Поиск = Объект.ЗначенияДоступа.НайтиСтроки(Отбор);
	КоличествоЗначений = Поиск.Количество();
	
	Для каждого СтрокаТаблицы Из Поиск Цикл
		СтрокаТаблицы.ЗапретНаВсе = ОписаниеВидаДоступа.ЗапретНаВсе;
		
	КонецЦикла; 
	
	ОбновитьПредставлениеИспользованияВидаДоступа(ОписаниеВидаДоступа, КоличествоЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляЗначенияДоступа

&НаКлиенте
Процедура ЗначенияДоступаПриИзменении(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено
		И НЕ Элементы.ВидыДоступа.ТекущиеДанные = Неопределено 
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДоступа) Тогда
		
		Элемент.ТекущиеДанные.ВидДоступа  = Элементы.ВидыДоступа.ТекущиеДанные.ВидДоступа;
		Элемент.ТекущиеДанные.Изменено    = Истина;
		Элемент.ТекущиеДанные.ЗапретНаВсе = Элементы.ВидыДоступа.ТекущиеДанные.ЗапретНаВсе;
		
	КонецЕсли;
	
	ОписаниеВидаДоступа = Элементы.ВидыДоступа.ТекущиеДанные;
	
	Отбор = Новый Структура("ВидДоступа", ОписаниеВидаДоступа.ВидДоступа);
	КоличествоЗначений = Объект.ЗначенияДоступа.НайтиСтроки(Отбор).Количество();
	
	ОбновитьПредставлениеИспользованияВидаДоступа(ОписаниеВидаДоступа, КоличествоЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элемент.ТекущиеДанные.ЗначениеДоступа = Неопределено Тогда
		
		ТекущиеДанные = Элементы.ВидыДоступа.ТекущиеДанные;
		
		Если НЕ ТекущиеДанные = Неопределено Тогда
			
			ЗначениеДоступа = ЗначениеДоступаНаСервере(ТекущиеДанные.ВидДоступа);
			
			Элемент.ТекущиеДанные.ЗначениеДоступа =  ЗначениеДоступа;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗначениеДоступаНаСервере(ВидДоступа)

	Возврат ВидДоступа.ТипЗначения.ПривестиЗначение();	
	
КонецФункции

&НаКлиенте
Процедура ЗначенияДоступаЗначениеДоступаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияДоступа.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ЗначениеДоступа = ВыбранноеЗначение Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДоступа"     , ТекущиеДанные.ВидДоступа);
		Отбор.Вставить("ЗначениеДоступа", ВыбранноеЗначение);
		
		Поиск = Объект.ЗначенияДоступа.НайтиСтроки(Отбор);
		
		Если Поиск.Количество() > 0 Тогда
			
			ЗначениеДоступа = ЗначениеДоступаНаСервере(ТекущиеДанные.ВидДоступа);
			
			ВыбранноеЗначение    = ЗначениеДоступа;
			СтандартнаяОбработка = Ложь;
			
		Иначе
			ТекущиеДанные.Добавление = Ложь;
			ТекущиеДанные.Изменение  = Ложь;
			ТекущиеДанные.Удаление   = Ложь;
			ТекущиеДанные.Изменено   = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаИзменениеПриИзменении(Элемент)
	Элементы.ЗначенияДоступа.ТекущиеДанные.Изменено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаДобавлениеПриИзменении(Элемент)
	Элементы.ЗначенияДоступа.ТекущиеДанные.Изменено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДоступаУдалениеПриИзменении(Элемент)
	Элементы.ЗначенияДоступа.ТекущиеДанные.Изменено = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеИспользованияВидаДоступа(ОписаниеВидаДоступа, КоличествоЗначений)
	
	Если КоличествоЗначений > 0 Тогда
		
		ПрописьЧисла = ЧислоПрописью(
			КоличествоЗначений,
			"Л = ru_RU",
			НСтр("ru = ',,,,,,,,0'"));
		
		ПрописьЧислаИПредмета = ЧислоПрописью(
			КоличествоЗначений,
			"Л = ru_RU",
			НСтр("ru = '-го значения,-х значений,-и значений,,,,,,0'"));
		
		ЧислоИПредмет = СтрЗаменить(
			ПрописьЧислаИПредмета,
			ПрописьЧисла,
			Формат(КоличествоЗначений, "ЧГ="));
		
		ОписаниеВидаДоступа.Использование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			?(ОписаниеВидаДоступа.ЗапретНаВсе,
			  НСтр("ru = 'Все запрещены, кроме %1'"),
			  НСтр("ru = 'Все разрешены, кроме %1'") ),
			ЧислоИПредмет);
		
	Иначе
		ОписаниеВидаДоступа.Использование =
			?(ОписаниеВидаДоступа.ЗапретНаВсе,
			  НСтр("ru = 'Все запрещены, без исключений'"),
			  НСтр("ru = 'Все разрешены, без исключений'") );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблиц()
	
	Объект.ВидыДоступа.Очистить();
	Объект.ЗначенияДоступа.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Объект.Пользователь);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_рлс_НастройкиПравДоступаПользователей.ВидДоступа,
	|	МАКСИМУМ(бит_рлс_НастройкиПравДоступаПользователей.ЗапретНаВсе) КАК ЗапретНаВсе,
	|	СУММА(ВЫБОР
	|			КОГДА бит_рлс_НастройкиПравДоступаПользователей.ЗначениеДоступа = НЕОПРЕДЕЛЕНО
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ЗначениеДоступа
	|ПОМЕСТИТЬ НастройкиВидаДоступа
	|ИЗ
	|	РегистрСведений.бит_рлс_НастройкиПравДоступаПользователей КАК бит_рлс_НастройкиПравДоступаПользователей
	|ГДЕ
	|	бит_рлс_НастройкиПравДоступаПользователей.Пользователь = &Пользователь
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_рлс_НастройкиПравДоступаПользователей.ВидДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ВидыДоступа.Ссылка КАК ВидДоступа,
	|	ЕСТЬNULL(НастройкиВидаДоступа.ЗапретНаВсе, ЛОЖЬ) КАК ЗапретНаВсе,
	|	ЕСТЬNULL(НастройкиВидаДоступа.ЗначениеДоступа, 0) КАК КоличествоЗначений
	|ИЗ
	|	ПланВидовХарактеристик.бит_ВидыДоступа КАК бит_ВидыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВидаДоступа КАК НастройкиВидаДоступа
	|		ПО (НастройкиВидаДоступа.ВидДоступа = бит_ВидыДоступа.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_рлс_НастройкиПравДоступаПользователей.ВидДоступа,
	|	бит_рлс_НастройкиПравДоступаПользователей.ЗначениеДоступа,
	|	бит_рлс_НастройкиПравДоступаПользователей.Добавление,
	|	бит_рлс_НастройкиПравДоступаПользователей.Изменение,
	|	бит_рлс_НастройкиПравДоступаПользователей.Удаление,
	|	НастройкиВидаДоступа.ЗапретНаВсе
	|ИЗ
	|	РегистрСведений.бит_рлс_НастройкиПравДоступаПользователей КАК бит_рлс_НастройкиПравДоступаПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВидаДоступа КАК НастройкиВидаДоступа
	|		ПО бит_рлс_НастройкиПравДоступаПользователей.ВидДоступа = НастройкиВидаДоступа.ВидДоступа
	|ГДЕ
	|	бит_рлс_НастройкиПравДоступаПользователей.Пользователь = &Пользователь
	|	И НЕ бит_рлс_НастройкиПравДоступаПользователей.ЗапретНаВсе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиВидаДоступа";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ВидыДоступа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ОбновитьПредставлениеИспользованияВидаДоступа(НоваяСтрока, Выборка.КоличествоЗначений);
		
	КонецЦикла; 
	
	Объект.ЗначенияДоступа.Загрузить(Результат[2].Выгрузить());
	
КонецПроцедуры

&НаСервере
// Процедура записывает изменения.
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаписатьИзменения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыДоступа"    , Объект.ВидыДоступа.Выгрузить());
	Запрос.УстановитьПараметр("ЗначенияДоступа", Объект.ЗначенияДоступа.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДоступа.ВидДоступа,
	|	ВидыДоступа.ЗапретНаВсе
	|ПОМЕСТИТЬ ТаблицаВидыДоступа
	|ИЗ
	|	&ВидыДоступа КАК ВидыДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияДоступа.ВидДоступа,
	|	ЗначенияДоступа.ЗначениеДоступа,
	|	ЗначенияДоступа.Добавление,
	|	ЗначенияДоступа.Изменение,
	|	ЗначенияДоступа.Удаление
	|ПОМЕСТИТЬ ТаблицаЗначенийДоступа
	|ИЗ
	|	&ЗначенияДоступа КАК ЗначенияДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидыДоступа.ВидДоступа КАК ВидДоступа,
	|	ТаблицаВидыДоступа.ЗапретНаВсе КАК ЗапретНаВсе,
	|	ТаблицаЗначенийДоступа.ЗначениеДоступа,
	|	ТаблицаЗначенийДоступа.Добавление,
	|	ТаблицаЗначенийДоступа.Изменение,
	|	ТаблицаЗначенийДоступа.Удаление
	|ИЗ
	|	ТаблицаВидыДоступа КАК ТаблицаВидыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийДоступа КАК ТаблицаЗначенийДоступа
	|		ПО ТаблицаВидыДоступа.ВидДоступа = ТаблицаЗначенийДоступа.ВидДоступа
	|ИТОГИ
	|	МАКСИМУМ(ЗапретНаВсе)
	|ПО
	|	ВидДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаВидыДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаЗначенийДоступа";
	
	ВыборкаВидыДоступа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидыДоступа.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.бит_рлс_НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидДоступа.Установить(ВыборкаВидыДоступа.ВидДоступа, Истина);
		НаборЗаписей.Отбор.Пользователь.Установить(Объект.Пользователь        , Истина);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Выборка = ВыборкаВидыДоступа.Выбрать();
		
		Если ВыборкаВидыДоступа.ЗапретНаВсе Тогда
		
			Запись = НаборЗаписей.Добавить();
			Запись.ВидДоступа   = ВыборкаВидыДоступа.ВидДоступа;
			Запись.Пользователь = Объект.Пользователь;
			Запись.ЗапретНаВсе  = Истина;
		
		КонецЕсли; 
		 
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.ЗначениеДоступа) Тогда
				Продолжить;
			КонецЕсли; 
			
			Запись = НаборЗаписей.Добавить();
			Запись.ВидДоступа      = Выборка.ВидДоступа;
			Запись.Пользователь    = Объект.Пользователь;
			Запись.ЗапретНаВсе     = Ложь;
			Запись.ЗначениеДоступа = Выборка.ЗначениеДоступа;
			Запись.Добавление      = Выборка.Добавление;
			Запись.Изменение       = Выборка.Изменение;
			Запись.Удаление        = Выборка.Удаление;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры // () 

#КонецОбласти
